---
kind: type
id: T:Autodesk.Revit.DB.RoutingConditions
source: html/15fcc55d-b099-6ed4-1915-8beaee70b596.htm
---
# Autodesk.Revit.DB.RoutingConditions

RoutingConditions contain routing information that is used as input when determining if a routing criterion,
 such as minimum or maximum diameter, is met.

## Syntax (C#)
```csharp
public class RoutingConditions : IDisposable
```